Revit 2024 API
ExternalServices.BuiltInExternalServices.SiteInsertService Property
 The external service which permits registration of an alternate implementation for Site insert.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId SiteInsertService { get; }
Visual Basic
Public Shared ReadOnly Property SiteInsertService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ SiteInsertService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace